{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "output_shape": null, "name": "lambda_1", "function_type": "lambda", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "subsample": [1, 1], "b_constraint": null, "nb_row": 5, "activation": "linear", "bias": true, "border_mode": "same", "name": "convolution2d_1", "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "subsample": [1, 1], "b_constraint": null, "nb_row": 5, "activation": "linear", "bias": true, "border_mode": "same", "name": "convolution2d_2", "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "activation": "linear", "bias": true, "border_mode": "same", "name": "convolution2d_3", "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 80, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "activation": "linear", "bias": true, "border_mode": "same", "name": "convolution2d_4", "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 100, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "activation": "linear", "bias": true, "border_mode": "same", "name": "convolution2d_5", "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_5", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "output_dim": 1024, "trainable": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": 5000, "bias": true, "name": "dense_1", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "output_dim": 256, "trainable": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": 1024, "bias": true, "name": "dense_2", "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "output_dim": 1, "trainable": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": 256, "bias": true, "name": "dense_3", "b_regularizer": null}}]}