{"config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>Q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape": null, "input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "trainable": true, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "activation": "linear", "nb_row": 7, "W_regularizer": null, "border_mode": "same", "activity_regularizer": null, "nb_col": 7, "nb_filter": 16, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [4, 4], "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "convolution2d_2", "activation": "linear", "nb_row": 5, "W_regularizer": null, "border_mode": "same", "activity_regularizer": null, "nb_col": 5, "nb_filter": 32, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_3", "activation": "linear", "nb_row": 3, "W_regularizer": null, "border_mode": "same", "activity_regularizer": null, "nb_col": 3, "nb_filter": 64, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_4", "activation": "linear", "nb_row": 3, "W_regularizer": null, "border_mode": "same", "activity_regularizer": null, "nb_col": 3, "nb_filter": 128, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 1024, "name": "dense_1", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "trainable": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 512, "name": "dense_2", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "trainable": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 256, "name": "dense_3", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "trainable": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "name": "dense_4", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "trainable": true, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}