{"config": [{"config": {"output_shape_type": "raw", "trainable": true, "batch_input_shape": [null, 80, 160, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>S\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "name": "lambda_1", "input_dtype": "float32", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"nb_col": 5, "trainable": true, "nb_row": 3, "bias": true, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 2], "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "nb_filter": 16, "name": "convolution2d_1", "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "elu"}, "class_name": "Activation"}, {"config": {"nb_col": 3, "trainable": true, "nb_row": 3, "bias": true, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "nb_filter": 16, "name": "convolution2d_2", "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "trainable": true, "nb_row": 3, "bias": true, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "nb_filter": 24, "name": "convolution2d_3", "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "trainable": true, "nb_row": 3, "bias": true, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "nb_filter": 32, "name": "convolution2d_4", "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "trainable": true, "nb_row": 3, "bias": true, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "nb_filter": 32, "name": "convolution2d_5", "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_4", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias": true, "output_dim": 512, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "input_dim": 288, "name": "dense_1", "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias": true, "output_dim": 128, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "input_dim": 512, "name": "dense_2", "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias": true, "output_dim": 64, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "input_dim": 128, "name": "dense_3", "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias": true, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "input_dim": 64, "name": "dense_4", "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}