{"config": [{"config": {"arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>S\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 80, 160, 1], "trainable": true, "input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "output_shape": null}, "class_name": "Lambda"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 16, "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "subsample": [1, 2], "b_constraint": null, "border_mode": "valid", "name": "convolution2d_1", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 16, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "name": "convolution2d_2", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 24, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "name": "convolution2d_3", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 32, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "name": "convolution2d_4", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 32, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "name": "convolution2d_5", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "output_dim": 512, "trainable": true, "input_dim": 288, "W_constraint": null, "b_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activation": "elu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "output_dim": 128, "trainable": true, "input_dim": 512, "W_constraint": null, "b_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activation": "elu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "output_dim": 64, "trainable": true, "input_dim": 128, "W_constraint": null, "b_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"activation": "elu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "output_dim": 1, "trainable": true, "input_dim": 64, "W_constraint": null, "b_constraint": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}