{"config": [{"config": {"function_type": "lambda", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>S\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "batch_input_shape": [null, 80, 160, 1], "output_shape_type": "raw", "output_shape": null, "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"activation": "linear", "border_mode": "valid", "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_1", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 2], "nb_filter": 8, "activity_regularizer": null, "nb_col": 5, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activation": "linear", "border_mode": "valid", "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_2", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "nb_filter": 8, "activity_regularizer": null, "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "border_mode": "valid", "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_3", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "nb_filter": 12, "activity_regularizer": null, "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "border_mode": "valid", "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_4", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "nb_filter": 16, "activity_regularizer": null, "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "border_mode": "valid", "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_5", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "nb_filter": 16, "activity_regularizer": null, "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 256, "trainable": true, "name": "dense_1", "activation": "linear", "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 128, "trainable": true, "name": "dense_2", "activation": "linear", "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 64, "trainable": true, "name": "dense_3", "activation": "linear", "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 1, "trainable": true, "name": "dense_4", "activation": "linear", "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}