{"config": [{"config": {"arguments": {}, "name": "lambda_1", "output_shape": null, "input_dtype": "float32", "trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>Q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"nb_row": 4, "name": "convolution2d_1", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "subsample": [4, 4], "activity_regularizer": null, "nb_filter": 16, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "activation": "linear", "nb_col": 4}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "name": "convolution2d_2", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 32, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "activation": "linear", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 2, "name": "convolution2d_3", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "activation": "linear", "nb_col": 2}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 2, "name": "convolution2d_4", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 128, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "activation": "linear", "nb_col": 2}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_3", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 2, "name": "convolution2d_5", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 256, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "activation": "linear", "nb_col": 2}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_4", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "same", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "name": "dense_1", "bias": true, "init": "glorot_uniform", "output_dim": 512, "trainable": true, "activity_regularizer": null, "input_dim": 3840, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "name": "dense_2", "bias": true, "init": "glorot_uniform", "output_dim": 256, "trainable": true, "activity_regularizer": null, "input_dim": 512, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "name": "dense_3", "bias": true, "init": "glorot_uniform", "output_dim": 1, "trainable": true, "activity_regularizer": null, "input_dim": 256, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}