{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "output_shape": null, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [2, 2], "trainable": true, "W_constraint": null, "nb_filter": 16, "W_regularizer": null, "nb_col": 8, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_row": 8, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_1", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [1, 1], "trainable": true, "W_constraint": null, "nb_filter": 32, "W_regularizer": null, "nb_col": 5, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_row": 5, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_2", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [1, 1], "trainable": true, "W_constraint": null, "nb_filter": 64, "W_regularizer": null, "nb_col": 5, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_row": 5, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_3", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_constraint": null, "name": "dense_1", "input_dim": 12800, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "bias": true, "output_dim": 1024, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_constraint": null, "name": "dense_2", "input_dim": 1024, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "bias": true, "output_dim": 512, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_constraint": null, "name": "dense_3", "input_dim": 512, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "bias": true, "output_dim": 256, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_constraint": null, "name": "dense_4", "input_dim": 256, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "bias": true, "output_dim": 1, "activity_regularizer": null}}]}