{"config": [{"config": {"function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "trainable": true, "input_dtype": "float32", "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"subsample": [2, 2], "init": "glorot_uniform", "name": "convolution2d_1", "nb_col": 8, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 16, "nb_row": 8, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_2", "nb_col": 5, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 32, "nb_row": 5, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_3", "nb_col": 5, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 64, "nb_row": 5, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1024, "b_regularizer": null, "b_constraint": null, "input_dim": 12800, "bias": true, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_2", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "output_dim": 512, "b_regularizer": null, "b_constraint": null, "input_dim": 1024, "bias": true, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_3", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "output_dim": 256, "b_regularizer": null, "b_constraint": null, "input_dim": 512, "bias": true, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "name": "dense_4", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "b_constraint": null, "input_dim": 256, "bias": true, "trainable": true, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}