{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}, "output_shape": null, "input_dtype": "float32", "trainable": true, "name": "lambda_1", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "b_regularizer": null, "name": "convolution2d_1", "nb_row": 8, "nb_filter": 16, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "activation": "linear", "subsample": [2, 2], "dim_ordering": "tf", "trainable": true, "nb_col": 8}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "b_regularizer": null, "name": "convolution2d_2", "nb_row": 5, "nb_filter": 32, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "activation": "linear", "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "b_regularizer": null, "name": "convolution2d_3", "nb_row": 5, "nb_filter": 64, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "activation": "linear", "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "strides": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "b_constraint": null, "bias": true, "output_dim": 1024, "W_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 12800, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "b_constraint": null, "bias": true, "output_dim": 512, "W_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 1024, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_3", "b_constraint": null, "bias": true, "output_dim": 256, "W_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 512, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_4", "b_constraint": null, "bias": true, "output_dim": 1, "W_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 256, "trainable": true}}]}