{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3]}, "class_name": "Lambda"}, {"config": {"W_constraint": null, "W_regularizer": null, "nb_col": 4, "subsample": [4, 4], "border_mode": "same", "activation": "linear", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_row": 4, "nb_filter": 8, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_1", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "activation": "linear", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 16, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_2", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "W_regularizer": null, "nb_col": 2, "subsample": [1, 1], "border_mode": "same", "activation": "linear", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_row": 2, "nb_filter": 32, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_3", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "W_regularizer": null, "nb_col": 2, "subsample": [1, 1], "border_mode": "same", "activation": "linear", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_row": 2, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_4", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": 3200, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 128, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"input_dim": 128, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "name": "dense_2", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}