{"keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "trainable": true, "name": "lambda_1", "input_dtype": "float32", "output_shape": null, "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>Q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 16, "bias": true, "b_constraint": null, "nb_col": 7, "dim_ordering": "tf", "name": "convolution2d_1", "activity_regularizer": null, "W_constraint": null, "nb_row": 7, "border_mode": "same", "subsample": [4, 4], "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 32, "bias": true, "b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "name": "convolution2d_2", "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "border_mode": "same", "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 64, "bias": true, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "name": "convolution2d_3", "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 128, "bias": true, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "name": "convolution2d_4", "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 6400, "bias": true, "name": "dense_1", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 1024, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"input_dim": 1024, "bias": true, "name": "dense_2", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 512, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"input_dim": 512, "bias": true, "name": "dense_3", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 256, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dense", "config": {"input_dim": 256, "bias": true, "name": "dense_4", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}}], "class_name": "Sequential"}