{"config": [{"config": {"name": "lambda_1", "function_type": "lambda", "output_shape": null, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3]}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 16, "b_regularizer": null, "trainable": true, "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 5, "bias": true, "W_constraint": null, "b_constraint": null, "nb_col": 5, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_2", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 16, "b_regularizer": null, "trainable": true, "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 5, "bias": true, "W_constraint": null, "b_constraint": null, "nb_col": 5, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_3", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 32, "b_regularizer": null, "trainable": true, "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "bias": true, "W_constraint": null, "b_constraint": null, "nb_col": 3, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_4", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "b_regularizer": null, "trainable": true, "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "bias": true, "W_constraint": null, "b_constraint": null, "nb_col": 3, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_4", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_5", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 128, "b_regularizer": null, "trainable": true, "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "bias": true, "W_constraint": null, "b_constraint": null, "nb_col": 3, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_5", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_1", "input_dim": 6400, "init": "glorot_uniform", "b_constraint": null, "bias": true, "output_dim": 1024, "W_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_2", "input_dim": 1024, "init": "glorot_uniform", "b_constraint": null, "bias": true, "output_dim": 512, "W_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_3", "input_dim": 512, "init": "glorot_uniform", "b_constraint": null, "bias": true, "output_dim": 1, "W_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}