{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 20, 80, 3], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>(\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "name": "lambda_1", "arguments": {}, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "name": "convolution2d_1", "nb_filter": 8, "bias": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_col": 3, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "name": "convolution2d_2", "nb_filter": 12, "bias": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_col": 3, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "elu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [1, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [1, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "name": "convolution2d_3", "nb_filter": 12, "bias": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_col": 3, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "name": "convolution2d_4", "nb_filter": 12, "bias": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_col": 3, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "elu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "output_dim": 512, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "elu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "output_dim": 128, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "elu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "name": "dense_3", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "output_dim": 64, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "elu", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "name": "dense_4", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "output_dim": 1, "b_constraint": null}}]}