{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "arguments": {}, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>N\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [4, 4], "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 4, "trainable": true, "b_constraint": null, "nb_filter": 8, "name": "convolution2d_1", "W_regularizer": null, "bias": true, "activation": "linear", "nb_row": 4, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 3, "trainable": true, "b_constraint": null, "nb_filter": 16, "name": "convolution2d_2", "W_regularizer": null, "bias": true, "activation": "linear", "nb_row": 3, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 2, "trainable": true, "b_constraint": null, "nb_filter": 32, "name": "convolution2d_3", "W_regularizer": null, "bias": true, "activation": "linear", "nb_row": 2, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 2, "trainable": true, "b_constraint": null, "nb_filter": 64, "name": "convolution2d_4", "W_regularizer": null, "bias": true, "activation": "linear", "nb_row": 2, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "input_dim": null, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 128, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_2", "W_regularizer": null, "input_dim": null, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 1, "init": "glorot_uniform"}}], "keras_version": "1.1.2"}