{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 8, "dim_ordering": "tf", "nb_row": 4, "subsample": [4, 4], "name": "convolution2d_1", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "same", "W_constraint": null, "nb_col": 4, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "dim_ordering": "tf", "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_2", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "same", "W_constraint": null, "nb_col": 3, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "dim_ordering": "tf", "nb_row": 2, "subsample": [1, 1], "name": "convolution2d_3", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "same", "W_constraint": null, "nb_col": 2, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "dim_ordering": "tf", "nb_row": 2, "subsample": [1, 1], "name": "convolution2d_4", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "same", "W_constraint": null, "nb_col": 2, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "dim_ordering": "tf", "nb_row": 2, "subsample": [1, 1], "name": "convolution2d_5", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "same", "W_constraint": null, "nb_col": 2, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_4", "trainable": true, "border_mode": "same", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 256, "W_regularizer": null, "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "activity_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 128, "W_regularizer": null, "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "activity_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_2"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_regularizer": null, "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "activity_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_3"}}]}