{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 160, 320, 3], "output_shape": null, "output_shape_type": "raw", "input_dtype": "float32", "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "nb_filter": 16, "bias": true, "name": "convolution2d_1", "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "nb_row": 4, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 4, "subsample": [2, 2], "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "nb_filter": 32, "bias": true, "name": "convolution2d_2", "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "nb_filter": 64, "bias": true, "name": "convolution2d_3", "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "nb_filter": 128, "bias": true, "name": "convolution2d_4", "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "nb_filter": 256, "bias": true, "name": "convolution2d_5", "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4", "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "input_dim": 12800, "name": "dense_1", "activity_regularizer": null, "output_dim": 1024, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "input_dim": 1024, "name": "dense_2", "activity_regularizer": null, "output_dim": 256, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "input_dim": 256, "name": "dense_3", "activity_regularizer": null, "output_dim": 1, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform"}}]}