{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 80, 160, 1], "input_dtype": "float32", "output_shape_type": "raw", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>S\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_1", "b_constraint": null, "activity_regularizer": null, "nb_filter": 16, "b_regularizer": null, "activation": "linear", "subsample": [1, 2], "bias": true, "border_mode": "valid", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_2", "b_constraint": null, "activity_regularizer": null, "nb_filter": 16, "b_regularizer": null, "activation": "linear", "subsample": [1, 1], "bias": true, "border_mode": "valid", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_3", "b_constraint": null, "activity_regularizer": null, "nb_filter": 24, "b_regularizer": null, "activation": "linear", "subsample": [1, 1], "bias": true, "border_mode": "valid", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_4", "b_constraint": null, "activity_regularizer": null, "nb_filter": 32, "b_regularizer": null, "activation": "linear", "subsample": [1, 1], "bias": true, "border_mode": "valid", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_5", "b_constraint": null, "activity_regularizer": null, "nb_filter": 32, "b_regularizer": null, "activation": "linear", "subsample": [1, 1], "bias": true, "border_mode": "valid", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_5"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 288, "W_constraint": null, "trainable": true, "output_dim": 512, "activation": "linear", "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"input_dim": 512, "W_constraint": null, "trainable": true, "output_dim": 128, "activation": "linear", "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"input_dim": 128, "W_constraint": null, "trainable": true, "output_dim": 64, "activation": "linear", "name": "dense_3", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"input_dim": 64, "W_constraint": null, "trainable": true, "output_dim": 1, "activation": "linear", "name": "dense_4", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "bias": true}}]}