{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 80, 160, 1], "name": "lambda_1", "output_shape": null, "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>S\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 2], "W_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "activation": "linear", "nb_filter": 16, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_col": 5, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "activation": "linear", "nb_filter": 16, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "activation": "linear", "nb_filter": 24, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "activation": "linear", "nb_filter": 32, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "activation": "linear", "nb_filter": 32, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "input_dim": null, "b_regularizer": null, "b_constraint": null, "output_dim": 512, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_6", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "input_dim": null, "b_regularizer": null, "b_constraint": null, "output_dim": 128, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_7", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "input_dim": null, "b_regularizer": null, "b_constraint": null, "output_dim": 64, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "input_dim": null, "b_regularizer": null, "b_constraint": null, "output_dim": 1, "bias": true}}]}