{"config": [{"config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>Q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "arguments": {}, "output_shape": null, "batch_input_shape": [null, 160, 320, 3], "trainable": true, "input_dtype": "float32", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"nb_row": 8, "b_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_1", "trainable": true, "border_mode": "same", "W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 8}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_2", "trainable": true, "border_mode": "same", "W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 32, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_3", "trainable": true, "border_mode": "same", "W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_4", "trainable": true, "border_mode": "same", "W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_5", "trainable": true, "border_mode": "same", "W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_4", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "b_constraint": null, "name": "dense_1", "input_dim": 3200, "W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "output_dim": 512}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "b_constraint": null, "name": "dense_2", "input_dim": 512, "W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "output_dim": 256}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "b_constraint": null, "name": "dense_3", "input_dim": 256, "W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}