{"config": [{"config": {"trainable": true, "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>R\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "nb_filter": 16, "border_mode": "same", "subsample": [2, 2], "b_regularizer": null, "activation": "linear", "nb_row": 8, "W_regularizer": null, "name": "convolution2d_1", "trainable": true, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_col": 8, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "subsample": [1, 1], "b_regularizer": null, "activation": "linear", "nb_row": 5, "W_regularizer": null, "name": "convolution2d_2", "trainable": true, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_col": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "nb_filter": 64, "border_mode": "same", "subsample": [1, 1], "b_regularizer": null, "activation": "linear", "nb_row": 5, "W_regularizer": null, "name": "convolution2d_3", "trainable": true, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_col": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "nb_filter": 128, "border_mode": "same", "subsample": [1, 1], "b_regularizer": null, "activation": "linear", "nb_row": 5, "W_regularizer": null, "name": "convolution2d_4", "trainable": true, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_col": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "nb_filter": 64, "border_mode": "same", "subsample": [1, 1], "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_regularizer": null, "name": "convolution2d_5", "trainable": true, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_col": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "maxpooling2d_4", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "output_dim": 512, "b_regularizer": null, "W_constraint": null, "input_dim": 3200, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "output_dim": 256, "b_regularizer": null, "W_constraint": null, "input_dim": 512, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "output_dim": 1, "b_regularizer": null, "W_constraint": null, "input_dim": 256, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_3"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}