{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "output_shape": null, "input_dtype": "float32", "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 16, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_1", "b_regularizer": null, "nb_col": 8, "W_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "border_mode": "same", "bias": true, "subsample": [2, 2], "W_constraint": null, "nb_row": 8}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 32, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "border_mode": "same", "bias": true, "subsample": [1, 1], "W_constraint": null, "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "border_mode": "same", "bias": true, "subsample": [1, 1], "W_constraint": null, "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 128, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_4", "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "border_mode": "same", "bias": true, "subsample": [1, 1], "W_constraint": null, "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_5", "b_regularizer": null, "nb_col": 3, "W_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "border_mode": "same", "bias": true, "subsample": [1, 1], "W_constraint": null, "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_4", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "name": "dense_1", "b_regularizer": null, "input_dim": 3200, "b_constraint": null, "trainable": true, "activation": "linear", "output_dim": 512, "bias": true, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "name": "dense_2", "b_regularizer": null, "input_dim": 512, "b_constraint": null, "trainable": true, "activation": "linear", "output_dim": 256, "bias": true, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "name": "dense_3", "b_regularizer": null, "input_dim": 256, "b_constraint": null, "trainable": true, "activation": "linear", "output_dim": 1, "bias": true, "W_constraint": null, "init": "glorot_uniform"}}], "keras_version": "1.2.1"}