{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "input_dtype": "float32", "arguments": {}, "function_type": "lambda", "output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>Q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "name": "convolution2d_1", "b_constraint": null, "subsample": [4, 4], "nb_row": 4, "activation": "linear", "activity_regularizer": null, "bias": true, "b_regularizer": null, "nb_filter": 16, "init": "glorot_uniform", "border_mode": "same", "W_regularizer": null, "nb_col": 4, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "name": "convolution2d_2", "b_constraint": null, "subsample": [1, 1], "nb_row": 3, "activation": "linear", "activity_regularizer": null, "bias": true, "b_regularizer": null, "nb_filter": 32, "init": "glorot_uniform", "border_mode": "same", "W_regularizer": null, "nb_col": 3, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "name": "convolution2d_3", "b_constraint": null, "subsample": [1, 1], "nb_row": 2, "activation": "linear", "activity_regularizer": null, "bias": true, "b_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "border_mode": "same", "W_regularizer": null, "nb_col": 2, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "name": "convolution2d_4", "b_constraint": null, "subsample": [1, 1], "nb_row": 2, "activation": "linear", "activity_regularizer": null, "bias": true, "b_regularizer": null, "nb_filter": 128, "init": "glorot_uniform", "border_mode": "same", "W_regularizer": null, "nb_col": 2, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "name": "convolution2d_5", "b_constraint": null, "subsample": [1, 1], "nb_row": 2, "activation": "linear", "activity_regularizer": null, "bias": true, "b_regularizer": null, "nb_filter": 256, "init": "glorot_uniform", "border_mode": "same", "W_regularizer": null, "nb_col": 2, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "same", "name": "maxpooling2d_4", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "name": "dense_1", "b_constraint": null, "output_dim": 512, "input_dim": 3840, "bias": true, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "name": "dense_2", "b_constraint": null, "output_dim": 256, "input_dim": 512, "bias": true, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "name": "dense_3", "b_constraint": null, "output_dim": 1, "input_dim": 256, "bias": true, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}}], "keras_version": "1.2.1"}