{"keras_version": "1.2.1", "config": [{"config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"nb_col": 8, "border_mode": "same", "subsample": [2, 2], "bias": true, "nb_row": 8, "activity_regularizer": null, "name": "convolution2d_1", "b_regularizer": null, "nb_filter": 16, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_col": 5, "border_mode": "same", "subsample": [1, 1], "bias": true, "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "nb_filter": 16, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 5, "border_mode": "same", "subsample": [1, 1], "bias": true, "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "nb_filter": 32, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 5, "border_mode": "same", "subsample": [1, 1], "bias": true, "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_4", "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 5, "border_mode": "same", "subsample": [1, 1], "bias": true, "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_5", "b_regularizer": null, "nb_filter": 128, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_4", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": 6400, "bias": true, "name": "dense_1", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 1024, "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 1024, "bias": true, "name": "dense_2", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 512, "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 512, "bias": true, "name": "dense_3", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 256, "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"input_dim": 256, "bias": true, "name": "dense_4", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 1, "W_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}