{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "name": "lambda_1", "arguments": {}, "input_dtype": "float32", "output_shape": null, "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 8, "trainable": true, "b_constraint": null, "subsample": [4, 4], "activation": "linear", "bias": true, "nb_row": 4, "init": "glorot_uniform", "name": "convolution2d_1", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "W_constraint": null, "nb_col": 4}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 16, "trainable": true, "b_constraint": null, "subsample": [1, 1], "activation": "linear", "bias": true, "nb_row": 3, "init": "glorot_uniform", "name": "convolution2d_2", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "W_constraint": null, "nb_col": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 32, "trainable": true, "b_constraint": null, "subsample": [1, 1], "activation": "linear", "bias": true, "nb_row": 2, "init": "glorot_uniform", "name": "convolution2d_3", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "W_constraint": null, "nb_col": 2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 64, "trainable": true, "b_constraint": null, "subsample": [1, 1], "activation": "linear", "bias": true, "nb_row": 2, "init": "glorot_uniform", "name": "convolution2d_4", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "W_constraint": null, "nb_col": 2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "output_dim": 128, "input_dim": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null}}]}