{"keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "batch_input_shape": [null, 80, 160, 1], "name": "lambda_1", "input_dtype": "float32", "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>S\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "nb_filter": 16, "b_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 3, "trainable": true, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 2], "name": "convolution2d_1", "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "nb_filter": 16, "b_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 3, "trainable": true, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_2", "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 3, "trainable": true, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_3", "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 3, "trainable": true, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_4", "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 3, "trainable": true, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_5", "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_5"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 512, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_1", "activity_regularizer": null, "input_dim": 288}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"output_dim": 128, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_2", "activity_regularizer": null, "input_dim": 512}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"output_dim": 64, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_3", "activity_regularizer": null, "input_dim": 128}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_4", "activity_regularizer": null, "input_dim": 64}}], "class_name": "Sequential"}